---
kind: method
id: M:Autodesk.Revit.DB.Structure.AnalyticalMember.IsValidCurve(Autodesk.Revit.DB.Curve)
source: html/a3087787-403a-556a-ca27-05ee9caf465d.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalMember.IsValidCurve Method

Verifies if the curve is valid for an Analytical Member.

## Syntax (C#)
```csharp
public static bool IsValidCurve(
	Curve curve
)
```

## Parameters
- **curve** (`Autodesk.Revit.DB.Curve`) - The curve to be verified.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null